{"format": "graph-model", "modelTopology": {"node": [{"op": "Placeholder", "name": "global_step", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"op": "Const", "name": "cls/squad/output_weights", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "cls/squad/output_bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/output/bottleneck/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/output/bottleneck/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/output/bottleneck/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/output/bottleneck/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_2/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_2/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_2/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_2/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_2/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_2/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_1/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_1/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_1/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_1/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_1/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_1/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_0/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_0/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_0/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_0/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_0/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/ffn_layer_0/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/self/query/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/self/query/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/self/key/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/self/key/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/attention/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/attention/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/attention/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/attention/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/self/value/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/self/value/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/value/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/value/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/value/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/value/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/attention/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/input/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/input/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_23/bottleneck/input/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/output/bottleneck/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/output/bottleneck/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/output/bottleneck/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/output/bottleneck/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_2/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_2/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_2/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_2/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_2/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_2/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_1/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_1/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_1/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_1/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_1/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_1/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_0/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_0/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_0/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_0/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_0/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/ffn_layer_0/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/self/query/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/self/query/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/self/key/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/self/key/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/attention/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/attention/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/attention/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/attention/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/self/value/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/self/value/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/value/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/value/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/value/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/value/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/attention/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/input/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/input/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_22/bottleneck/input/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/output/bottleneck/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/output/bottleneck/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/output/bottleneck/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/output/bottleneck/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_2/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_2/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_2/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_2/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_2/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_2/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_1/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_1/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_1/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_1/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_1/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_1/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_0/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_0/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_0/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_0/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_0/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/ffn_layer_0/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/self/query/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/self/query/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/self/key/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/self/key/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/attention/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/attention/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/attention/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/attention/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/self/value/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/self/value/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/value/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/value/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/value/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/value/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/attention/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/input/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/input/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_21/bottleneck/input/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/output/bottleneck/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/output/bottleneck/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/output/bottleneck/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/output/bottleneck/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_2/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_2/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_2/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_2/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_2/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_2/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_1/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_1/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_1/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_1/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_1/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_1/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_0/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_0/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_0/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_0/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_0/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/ffn_layer_0/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/self/query/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/self/query/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/self/key/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/self/key/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/attention/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/attention/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/attention/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/attention/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/self/value/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/self/value/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/value/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/value/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/value/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/value/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/attention/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/input/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/input/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_20/bottleneck/input/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/output/bottleneck/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/output/bottleneck/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/output/bottleneck/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/output/bottleneck/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_2/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_2/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_2/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_2/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_2/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_2/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_1/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_1/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_1/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_1/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_1/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_1/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_0/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_0/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_0/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_0/output/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_0/intermediate/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/ffn_layer_0/intermediate/dense/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/attention/output/FakeLayerNorm/beta", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/attention/output/FakeLayerNorm/gamma", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/attention/output/dense/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/attention/self/query/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "bert/encoder/layer_19/attention/self/query/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": 